app/Services/CacheStatusModelServices.php

select * from `statuses`
---
    public static function getData() {

       return Cache::rememberForever('statusData', function () {
            return Status::get();