app/Services/CacheModelServices.php

    public static function getRegionVwData()
    {

       return   Cache::rememberForever('ٌRegionVwData', function () {

                return   AddressNameVw::select('region_id', 'region_name')
                    ->groupby('region_id')
                    ->orderBy('region_id', 'ASC')
                    ->get();
---
select `region_id`, `region_name` from `address_name_vw` group by `region_id` order by `region_id` asc

    public static function getCityVwData()
    {

        return   Cache::rememberForever('CityVwData', function () {
            return   AddressNameVw::select('region_id', 'region_name', 'city_name', 'city_id')
                ->groupby('city_id')
                ->orderBy('city_id', 'DESC')
                ->get();
---
select `region_id`, `region_name`, `city_name`, `city_id` from `address_name_vw` group by `city_id` order by `city_id` desc

    public static function getNeighbourhoodVwData()
    {

        return   Cache::rememberForever('NeighbourhoodVwData', function () {
            return   AddressNameVw::select('region_id', 'region_name', 'city_name', 'city_id','neighbourhood_id','neighbourhood_name')
                ->groupby('neighbourhood_id')
                ->orderBy('neighbourhood_id', 'DESC')
                ->get();
---
select `region_id`, `region_name`, `city_name`, `city_id`, `neighbourhood_id`, `neighbourhood_name` from `address_name_vw` group by `neighbourhood_id` order by `neighbourhood_id` desc