app/Livewire/MyApp/CitzenServices/ServicesIndex.php

    public  function services(int|null $id = null)
    {
        if ($id) {
            $data = CitzenServices::find($id);
---
select * from `citzen_services` where `citzen_services`.`id` = 22 limit 1