app/Livewire/MyApp/CitzenServices/ServicesEdit.php

    public function deleteServicesImages(mixed $key): void
    {

          if ((!empty($this->services_images_path)) &&  $this->services_images_path[$key]  ) {


           Storage::disk('public')->delete($this->services_images_path[$key]);

           unset($this->services_images_path[$key]);

           CitzenServices::findOrfail($this->editServicesId)->update([
            'services_images' =>$this->services_images_path,
           ]);
---
select * from `citzen_services` where `citzen_services`.`id` = 22 limit 1
update `citzen_services` set `services_images` = '{\"0\":\"services_images\\/services_images1756729598_97983.png\",\"2\":\"services_images\\/services_images1756724428_91477.jpg\"}', `citzen_services`.`updated_at` = '2025-09-01 15:26:54' where `id` = 22