app/Livewire/AddressesModule/CityResource.php

    public function render(): View
    {

        $cities = AddressNameVw::groupby('city_id')
            ->orderBy('city_id', 'DESC')
            ->NameSearch($this->search)
            ->RegionListSearch($this->regionIdSearch)
            ->paginate($this->perPage);
---
select * from `address_name_vw` group by `city_id` order by `city_id` desc limit 5 offset 15