app/Livewire/AddressesModule/LocationResource.php

select * from `address_name_vw` group by `location_id` order by `location_name` asc limit 5 offset 15
---
    public function render(): View
    {

        $regions =  CacheModelServices::getRegionVwData();
        $cities  =   CacheModelServices::getCityVwData();

        $locations = AddressNameVw::groupby('location_id')
            ->orderBy($this->sortBy, $this->sortdir)
            ->LocationNameSearch($this->search)
            ->RegionListSearch($this->regionIdSearch)
            ->CityListSearch($this->cityIdSearch)
            ->paginate($this->perPage);