app/Livewire/AddressesModule/NeighbourhoodResource.php

    public function render(): View
    {


        $regions =Region::get();
---
select * from `regions`