app/Livewire/UserModule/UserIndex.php

select * from `users` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `users`
---
    public function render()
    {

        if(Gate::denies('user.all.resource')) {
            abort(403,__('customTrans.you have no access'));
         }


        $title = __('customTrans.users') ;
        $pageTitle =  __('customTrans.users') ;

        $users = User::SearchName($this->search)
            ->SearchUserType($this->searchUsertype)
            ->orderBy($this->sortBy, $this->sortdir)
            ->paginate($this->perPage);