app/Livewire/AppSetting/UsersProfile/Resource.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function mount(): void
    {
        if (Auth::user()) {
            $this->userData =  User::findOrfail(Auth::user()->id);