app/Livewire/Dashboard/Cards/Resource.php

    public  function cards():  mixed
    {
        return Card::with(['status:id,status_name'])
---
select * from `statuses` where `statuses`.`id` in (24)