app/Livewire/Dashboard/StatusModule/StatusClass.php

    public function statusesAll()
    {
        return Status::with(['systemname:id,system_name', 'status_p_id_sub:id,p_id_sub,status_name', 'status_p_id:id,p_id,status_name'])
            ->select('status_name', 'id',   'p_id_sub', 'used_in_system_id');
---
select `id`, `p_id_sub`, `status_name` from `statuses` where `statuses`.`id` in (null, 6, 10, 16, 23)

    public function statuses()
    {
        return $this->statusesAll()
            ->SearchName($this->search)
            ->SearchpId($this->PidSearch)
            ->SearchSystemName($this->SystemName)
            ->orderBy($this->sortBy, $this->sortdir)
            ->paginate($this->perPage);
---
select count(*) as aggregate from `statuses`