app/Http/Controllers/SendNotificationController.php

    public function index(): void {
        $user=User::find(1);
---
select * from `users` where `users`.`id` = 1 limit 1