app/Models/User.php

    public static function user($user_name) {
       return  $user = User::where('user_name', $user_name)->first();
---
select * from `users` where `user_name` = 'samer' limit 1