app/Livewire/Website/Cards.php

select `card_title`, `card_text`, `card_img` from `cards` where `card_img` is not null and `cards`.`deleted_at` is null order by `created_at` desc
---
    public function cards() {

       return Card::select('card_title', 'card_text', 'card_img')->whereNotNull('card_img')->orderBy('created_at', 'desc')->get();