app/Livewire/Website/ContactUs.php

    public function sendEmail() {

        $this->validate();

        $data = [
             'name' => $this->name,
             'phone' => $this->phone,
             'email' => $this->email,

             'message' => $this->message,
        ];

       Mail::to('eng.samertawil@gmail.com')->send(new SupportMail($data));

       toastr()->success('تم ارسال الايميل بنجاح');

       $user=User::find(1);
---
select * from `users` where `users`.`id` = 1 limit 1