app/Livewire/Ability/AbilityResource.php

select * from `abilities` order by `created_at` desc limit 10 offset 0
select * from `module_names` where `module_names`.`id` in (1)
select count(*) as aggregate from `abilities`
---
    public function render()
    {

         if(Gate::denies('ability.all.resource')) {
             abort(403,'ليس لديك الصلاحية اللازمة');
         }

        $pageTitle = __('customTrans.create ability');
        $title = $pageTitle;

        $abilities = Ability::with('moduleName')
            ->SearchName($this->search)
            ->searchModuleId($this->searchModuleId)
            ->withoutGlobalScope('not-active')->orderBy($this->sortBy, $this->sortdir)->paginate($this->perPage);