app/Livewire/Ability/AbilityCreate.php

    public function ModuleNames() {
        return ModuleName::get();
---
select * from `module_names`