app/Livewire/Ability/AbilityResource.php

select * from `abilities` order by `created_at` desc limit 10 offset 0
select * from `module_names` where `module_names`.`id` in (1)
select count(*) as aggregate from `abilities`
---
    public function abilities() {
        return Ability::with(['module_name'])
        ->SearchName($this->search)
        ->searchModuleId($this->searchModuleId)
        ->withoutGlobalScope('not-active')->orderBy($this->sortBy, $this->sortdir)->paginate($this->perPage);

select * from `abilities` where `abilities`.`id` = 53 limit 1
---
    public function edit($id)
    {


        $this->editAbilityId = $id;
        $data = Ability::withoutGlobalScope('not-active')->find($id);

select * from `module_names`
---
    public function ModuleNames() {
        return ModuleName::get();